/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   debug_env.h                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: echung <echung@student.42seoul.kr>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/21 17:17:34 by echung            #+#    #+#             */
/*   Updated: 2021/10/21 17:17:37 by echung           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef DEBUG_ENV_H
# define DEBUG_ENV_H

# include "core/env/env.h"

/**
 * 환경 변수 출력
 * 
 * @param env 환경 변수 구조체
 */
int	print_env(t_env *env);

#endif
